{
  "contact": {
    "phone": "+55 021 97627 8160",
    "email": "contact@thluiz.com",    
    "location": "Rio de Janeiro, Brazil"
  },
  "skills": [
    {
      "title": "General",
      "type": "tag",
      "subskills": [        
        {
          "name": "Backend Development"          
        },
        {
          "name": "Mentoring"
        },
        {
          "name": "Frontend Development"
        },
        {
          "name": "Architecture"
        },
        {
          "name": "DevOps"
        },
        {
          "name": "Project Management"
        },
        {
          "name": "Tech Lead"
        }
      ]
    },
    {
      "title": "Languages",
      "type": "tag",
      "subskills": [
        {
          "name": "C#"
        },
        {
          "name": "Javascript"
        },
        {
          "name": "Typescript"
        },
        {
          "name": "F#"
        },
        {
          "name": "Powershell"
        },
        {
          "name": "Elixir"
        },
        {
          "name": "Ruby"
        },
        {
          "name": "Dart"
        },
        {
          "name": "CSS"
        },
        {
          "name": "Xml/Xslt"
        }
      ]
    },
    {
      "title": "Frameworks",
      "type": "tag",
      "subskills": [
        {
          "name": "ASP.Net MVC"
        },
        {
          "name": ".Net Core"
        },
        {
          "name": "Angular 2+"
        },
        {
          "name": "Bootstrap"
        },
        {
          "name": "Jquery"
        },
        {
          "name": "AngularJs"
        },        
        {
          "name": "NodeJs"
        },
        {
          "name": "Express"
        },
        {
          "name": "React"
        },
        {
          "name": "Gatsby"
        },
        {
          "name": "TailwindCss"
        },
        {
          "name": "Nhibernate"
        },
        {
          "name": "Entity Framework"
        },
        {
          "name": "Ruby on Rails"
        },
        {
          "name": "Phoenix Framework"
        },
        {
          "name": "Microsoft Bot Framework"
        },
        {
          "name": "Xamarin"
        },
        {
          "name": "Blazor"
        }
      ]
    },
    {
      "title": "Software & Platforms",
      "type": "tag",
      "subskills": [
        {
          "name": "Azure"
        },
        {
          "name": "Windows Server"
        },
        {
          "name": "Linux"
        },
        {
          "name": "IIS"
        },
        {
          "name": "OTP"
        },
        {
          "name": "Docker"
        },
        {
          "name": "Microsoft Visual Studio"
        },
        {
          "name": "VS Code"
        },
        {
          "name": "Biztalk"
        },
        {
          "name": "Sharepoint"
        },
        {
          "name": "Dokku"
        },
        {
          "name": "Heroku"
        },
        {
          "name": "Digital Ocean"
        },
        {
          "name": "Github (actions)"
        }
      ]
    },
    {
      "title": "Databases",
      "type": "tag",
      "subskills": [
        {
          "name": "MS Sql"
        },
        {
          "name": "PostgreSql"
        },
        {
          "name": "MySql"
        },
        {
          "name": "CosmoDB"
        },
        {
          "name": "Firebase"
        },
        {
          "name": "Mongodb"
        },
        {
          "name": "Redis"
        },
        {
          "name": "ETS"
        },
        {
          "name": "Mnesia"
        }
      ]
    },
    {
      "title": "Methodologies",
      "type": "tag",
      "subskills": [
        {
          "name": "TDD"
        },
        {
          "name": "DDD"
        },
        {
          "name": "XP"
        },
        {
          "name": "Kanban"
        }
      ]
    },
    {
      "title": "Hobbies",
      "type": "tag",
      "subskills": [
        {
          "name": "Kung Fu"
        },
        {
          "name": "Painting"
        },
        {
          "name": "Drawing"
        }
      ]
    }
  ],
  "summary": "I am a self-taught full stack developer who can quickly adapt to new circumstances. With a multidisciplinary skill set acquired over 15+ years in various domains, I make fast and solid web applications to solve problems while maintaining deadlines and budgets. ",
  "education": [
    {
      "institution": "Moy Yat Ving Tsun Martial Intelligence",
      "institution_url": "http://myvt.org/",
      "degree": "Final Superior Level",
      "subtitle_degree": "of Martial Intelligence Program",
      "start": "11/2014",
      "end": ""
    },
    {
      "institution": "Moy Yat Ving Tsun Martial Intelligence",
      "institution_url": "http://myvt.org/",
      "degree": "Basic to Medial Superior Level",
      "subtitle_degree": "of Martial Intelligence Program",
      "start": "10/2005",
      "end": "11/2014"
    },
    {
      "institution": "UERJ (Rio de Janeiro State University) ",
      "institution_url": "https://en.wikipedia.org/wiki/Rio_de_Janeiro_State_University",
      "degree": "Chemical Engineering",
      "start": "2003",
      "end": "2006 (Not completed)"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack developer & Mentor",
      "company": "Baires Dev",      
      "description": "Full-Stack Developer and Mentor working with Microsoft technologies (Azure and .Net), Angular, and VueJs",
      "achievements": { 
        "title": "Some achievements:",
        "list": [
        "I've migrated old legacy applications to be microservice solutions with Azure Functions in record time;",
        "Successfully introduce a TDD culture - Hundreds of tests written covering critical paths and securing or deployments;",        
        "Make the API's clients generation for Javascript fully automated (with OpenAPI and DevOps), reducing the time to front-end adopt changes;",
        "Mentoring developers to increase productivity in multiple clients;",
        "Received the R&D Spotlight Award for the last quarter of 2021 on a key player in the hospitality industry."
        ]
      },
      "start": "03/2021",
      "end": ""
    },
    {
      "role": "Full-Stack developer & Tech Leader",
      "company": "White Fox",      
      "description": "Full-Stack developer working with Microsoft technologies (C#, WCF, WSSF, Nhibernate) on the back-end and Angular/Javascript/Xslt on the front-end. Also Working as a tech leader and solutions architect using agile methodologies (Scrum, TDD, XP etc.) for B&T (one of the most outstanding money exchange brokers here in Brazil).",
      "achievements": { 
        "title": "Some of our team achievements over this decade:",
        "list": [
        "Implemented a test culture (TDD) mitigating errors in deployments and eliminating regressions and bugs in production;",
        "Automated deployments with Azure Devops and management activities with Microsoft Bot Framework;",
        "Maintained and evolved old monoliths, dividing them over microservices communicating through Sql/Azure ServiceBroker to escalate from dozens to thousands of requests per minute.",        
        "Integrated with different institutions like Bacen STA (Brazil's Central Bank messaging system), Receita Federal (Brazil's Federal Reserve), Brasil Pré-Pagos (Prepaid multi-currency Card) etc;",
        "Integrated payments and receiving from electronic transfers in Brazil (TED);",
        "Integrated with cryptocurrencies (Bitcoin) for payment and receiving in Brazilian Real;",
        "Ported ActiveWriter to Visual Studio 2017 and 2019 so the team can work with modern setup even in legacy Nhibernate applications.",
        "From 03/2021, I've started work as a Consultant for critical solutions and specifications;"
        ]
      },
      "start": "11/2009",
      "end": "03/2021"
    },
    {
      "role": "Biztalk and Sharepoint Consultant",
      "company": "Ecorp",
      "description": "Senior consultant and developer in Microsoft BizTalk, SharePoint, SQL Server, ASP.NET working directly to customers from Rio de Janeiro (Light and L'Oreal) performing technical management, gathering requirements, application development, and SAP integrations maintenance (XI and PI modules).",
      "achievements": { 
        "title": "Key Achievements:",
        "list": [
        "Implemented Biztalk integration between oracle problem system with SAP portable mobile gateway. This integration addressed all requests for external support from Light customers in Rio de Janeiro;",        
        "Automated the publishing of Light KPIs from Excel direct into the company's internal Sharepoint."
        ]
      },
      "start": "01/2009",
      "end": "11/2009"
    },
    {
      "role": "Senior Developer",
      "company": "Oi - Accenture",
      "description": "Maintenance of CRM System / ERP of the OI Tsunami project (SIA) and EPM (Sharepoint and Microsoft Project) with C# programming (Asp.Net and Desktop) using CCF, SQL Server and WCF; Systems optimizations and database management with Oracle and MS SQL Server. Also gathering requirements, negotiating deadlines, planning projects directly with the customers.",
      "achievements": { 
        "title": "Key Achievements:",
        "list": [
        "Implemented M.A.R.T a walkthrough system that, using external APIs for testing phone line quality, guides the call-center operators what actions had to be done to help customers (yep, the system that asks you to turn your modem off and on);",        
        "Improved the performance of the monthly conciliation process of Oi (Batimento) 24x. It used to take up to 12 hours a month to finish and after optimization, it took less than 30 minutes."
        ]
      },
      "start": "11/2007",
      "end": "01/2009"
    },
    {
      "role": "Senior Developer & Team Leader",
      "company": "Always Web",
      "description": "Programming in several languages (C#, VB, PHP, Javascript, ASP and even ActionScript) for Web and Desktop, database management (SQL SERVER, MYSQL and Oracle). Also working as a Project Manager and Team Leader creating functional and technical specifications for two teams between Rio de Janeiro and São Paulo. Our principal clients were Aliança do Brasil (Insurance company of Banco do Brasil), Cultura Inglesa (English School) and Thomson Edu.",
      "start": "06/2006",
      "end": "11/2007"
    },
    {
      "role": "Web Developer",
      "company": "AG Sistemas",
      "description": "Web Developer working with PHP and ASP classic, developing and maintaining the Apligraf´s CRM/ERP for StockMarket. For Digipix, We developed their photographic revelation service for companies. This service is still in use in Brazilian e-commerces like B2W (Americanas.com, Submarino, Shoptime), Saraiva, Extra etc.",
      "start": "11/2004",
      "end": "06/2006"
    }    
  ],
  "social": [    
    {
      "service": "twitter",
      "url": "https://twitter.com/thluiz"
    },
    {
      "service": "github",
      "url": "https://github.com/thluiz"
    }
  ],
  "role": "Full Stack Developer and Tech Leader",
  "projects": {
    "title": "Side Projects",
    "subtitle": "The best way to learn new languages and paradigms are building and testing them. Therefore, I am always open to experiment and build tools to help people around me. It usually lead me to new ways to approach and resolve problems.",
    "projects": [
      {
        "name": "SIG (Integrated Management System)",
        "company": "MYVT MI.IM",
        "start": "11/2018",        
        "technologies": "Node.js, Angular 2+, MS Sql Server, Firebase",
        "description": "CRM/ERP system write in TypeScript (back-end) and Angular 2+ (front-end). Using Firebase for sync multiple clients providing real-time updates and communication between MYVTMI.IM branches. They are planning expansion to Angola and Miami so it will become a multinational system.",
        "links": [
          { "title": "Visit Back-End", "url": "https://github.com/thluiz/sam-apinode" }
        ]
      },
      {
        "name": "Genesys - SRD",
        "company": "Grifo Editorial",
        "start": "06/2019",
        "technologies": "Gatsby, React, PWA",
        "description": "Genesys SRD is a Gatsby PWA with some customizations for the publisher. They need an offline reference guide for their players. It uses a Vercel (now.js) integration to automatize its own publication. The best ideas are the simplest ones.",
        "links": [
          { "title": "Visit Source Code", "url": "https://github.com/thluiz/genesys-srd" },
          { "title": "Visit Site", "url": "https://genesys-srd.grifo.now.sh/" }
        ]
      },
      {
        "name": "Elug |> RJ",
        "company": "Meetup group",        
        "start": "2016",        
        "end": "not so active",
        "technologies": "Elixir, Phoenix Framework, OTP, Web RTC",
        "description": "For those who do not bother with dynamic languages, Elixir is an invite to 'fall in love'. Built over the powerful OTP from Erlang, I believe that every programmers should look for the ideas behind it. I have joined as an organizer in 2016 and made two great events: the fourth, where we built a real-time Audio and Video chat over WebRTC; and the sixth, where we built a multiplayer starship game. I was planning to revamp it in 2020 but the pandemic delayed it to 2021.",
        "links": [
          { "title": "Visit Meet Up", "url": "https://www.meetup.com/elixir-rj/" },
          { "title": "Visit 6th presentation", "url": "https://github.com/thluiz/sexto_elug_rj" },
          { "title": "Visit 4th presentation", "url": "https://github.com/thluiz/quartoElugRJ" }
        ]
      },
      {
        "name": "Jarvis",
        "company": "White Fox",
        "start": "09/2018",
        "end": "12/2019",
        "technologies": "Microsoft Bot Framework, NodeJs, Typescript, MS Sql Server, LUIS (Language Understanding Service)",
        "descriptions": [
          "At White Fox, we support clients over chat applications, and we have an in house software for billing and planning. It was a natural step to implement a virtual assistant to help us integrate both. Jarvis was a humorous and grumpy Skype chat application wrote in typescript using Microsoft Bot Framework and the Language Understanding Service (to translate users input into intents and actions).",
          "His capabilities included search for tasks, projects, registering billing, check team velocity and common repetitive tasks like generate codes and valid documents (CPF/CEPs, CNPJs...).", 
          "With new versions of Bot Framework, We create a new assistant called Lana on Microsoft Teams with most of Jarvis capabilities; we are planning to integrate her with Azure Devops (for CI/CD) and a service desk system."
        ],
        "links": [
          { "title": "Visit Source Code", "url": "https://github.com/thluiz/jarvis-whitefox" }
        ]        
      },
      {
        "name": ".TV",
        "company": ".TV",
        "start": "11/2006",
        "end": "01/2010",
        "technologies": "Ruby on Rails, AngularJs, Bootstrap, PostgreSql",
        "description": "Web channel system. It used a Ruby on Rails application to upload, orchestrate, and encode videos in different formats for the web. The idea was to explore specific niches while granting fully control of content and audience. By the time they started YouTube was not lucrative and It was before his acquisition by google. They discontinued their principal project (Psicologica.TV - a psychology channel), after the YouTube/Facebook expansion. However, <a href='http://yehudim.tv' target='_blank' class='text-secondary-500'>Yehudim.TV</a> (a Jewish channel) still working and they sold <a href='http://itvision.tv' target='_blank' class='text-secondary-500'>ITVision.TV</a> (an IT corporate channel – that now has a more modern version)."        
      }
    ]
  },
  "fullname": "Thiago Luiz Silva Pereira"
}
